Autodesk.Navisworks.Api.FileResolutionResponse
User response from request for file resolution

Autodesk.Navisworks.Api.FileResolutionResponse.OK
User has supplied an updated file reference

Autodesk.Navisworks.Api.FileResolutionResponse.Cancel
User wants to cancel the entire operation

Autodesk.Navisworks.Api.FileResolutionResponse.Ignore
User wants to ignore this unresolved file

Autodesk.Navisworks.Api.FileResolutionResponse.IgnoreAll
User wants to ignore this and any other unresolved files